# Характеристки коллекцій:
# - доступні операції (додавання, видалення, куди додавати та де видаляти)
# - способом доступа (пошук, доступ по індексу, доступ по ключу)
# - складністю (complexity) операцій


# List (список) - коллекція куди можна додавати/видаляти в будь яке місце, та звертатися за індексом
x = [1, 33, 56, 2, 18]
x.append(54)
x.remove(<value>) - видалити по значенню
x.pop(<index>) - видалити по індексу, повертає видалений елемент
x.sort() - сортування по зростанню
x.reverse() - розвернути в зворотньому напрямку (без сортування)
len(<список>) - довжина

if (x):
    print('not empty')

List comprehension: - не змінює вихідний список
----------
[el*2 for el in x]

result = []
for el in x:
    result.append(el*2)
---------
[el*2 for el in x if el % 3 == 0]

result = []
for el in x:
    if (el % 3 == 0):
        result.append(el*2)
--------

# Dictionary (словник) - {key,value}, кожен ключ може бути доданий тільки один раз, повторне додавання з існуючим ключем переписує значення

# Set (набір) - набір унікальний значень. Кожне значення буде присутнє тільки один раз, навіть якщо додане багато разів.

# Tuple (кортеж) - статичний набір значень (immutable).